In [1]:
import numpy as np
import pandas as pd

In [2]:
sozlukVerisi = {"Istanbul" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [4]:
# dropna ile veri olmayan kısımları yani NaN olanları direk çıkar demektir.
# Bunu yaparken eğer bir satırda(rowda) NaN varsa o satırı komple siliyor.
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [7]:
havaDurumuDataFrame.dropna(axis=0)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [6]:
havaDurumuDataFrame.dropna(axis=1) # Eğer bir columnda(kolonda) NaN varsa o kolonu komple siliyor.

   Izmir
0     40
1     39
2     38

In [10]:
yeniVeri = {"Istanbul" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38],"Antalya" : [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [11]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [13]:
# Burada axis=1 ile kolonları kontrol et ve tresh=2 ile 2 ve üzeri NaN içeren kolon varsa komple yok et deriz:
yeniDataFrame.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [15]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [16]:
# NaN içeren alanlara standart bir değer ataması yapmak için fillna(..) kullanırız:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [23]:
maasSozlugu = {"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Calısan İsmi":["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
               "Maas":[100,150,200,300,400,500]
              }

In [24]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [25]:
maasDataFrame

   Departman Calısan İsmi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [26]:
# pandasın içerisinden DataFrameGroupBy sınıfından bir obje oluşturdum der.
maasDataFrame.groupby("Departman")

In [27]:
grupObjesi = maasDataFrame.groupby("Departman")

In [28]:
# Hangi departmanda kaç kişi çalışıyor bunu gösterir.
grupObjesi.count()

           Calısan İsmi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [29]:
grupObjesi.mean()

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [30]:
grupObjesi.min()

          Calısan İsmi  Maas
Departman
Hukuk            Fatma   400
Pazarlama         Atil   200
Yazılım          Ahmet   100

In [31]:
grupObjesi.max()

          Calısan İsmi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [32]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

In [38]:
grupObjesi["Maas"].sum()

Departman
Hukuk        900
Pazarlama    500
Yazılım      250
Name: Maas, dtype: int64